In [ ]:
#Name:Lanke Payal
#Roll No:152
#Div:B
#Date:22/08/25

In [24]:
import pandas as pd

In [ ]:
df=pd.read_csv("student_dataset.csv")#Read the datset
print(df)

       ID          Name  Age  Marks  Gender
0       1     Student_1   24     94    Male
1       2     Student_2   21     81  Female
2       3     Student_3   22     90    Male
3       4     Student_4   24     56  Female
4       5     Student_5   20     44  Female
..    ...           ...  ...    ...     ...
995   996   Student_996   23     82  Female
996   997   Student_997   18     73  Female
997   998   Student_998   24     96  Female
998   999   Student_999   21     65    Male
999  1000  Student_1000   23     80    Male

[1000 rows x 5 columns]

In [ ]:
df.head() #First 5

   ID       Name  Age  Marks  Gender
0   1  Student_1   24     94    Male
1   2  Student_2   21     81  Female
2   3  Student_3   22     90    Male
3   4  Student_4   24     56  Female
4   5  Student_5   20     44  Female

In [ ]:
df.tail() #Last 5

       ID          Name  Age  Marks  Gender
995   996   Student_996   23     82  Female
996   997   Student_997   18     73  Female
997   998   Student_998   24     96  Female
998   999   Student_999   21     65    Male
999  1000  Student_1000   23     80    Male

In [ ]:
df.shape #Rows and Columns

(1000, 5)

In [ ]:
df.isnull #null values

<bound method DataFrame.isnull of        ID          Name  Age  Marks  Gender
0       1     Student_1   24     94    Male
1       2     Student_2   21     81  Female
2       3     Student_3   22     90    Male
3       4     Student_4   24     56  Female
4       5     Student_5   20     44  Female
..    ...           ...  ...    ...     ...
995   996   Student_996   23     82  Female
996   997   Student_997   18     73  Female
997   998   Student_998   24     96  Female
998   999   Student_999   21     65    Male
999  1000  Student_1000   23     80    Male

[1000 rows x 5 columns]>

In [ ]:
df.index #return index range

RangeIndex(start=0, stop=1000, step=1)

In [ ]:
df.columns #columns

Index(['ID', 'Name', 'Age', 'Marks', 'Gender'], dtype='object')

In [ ]:
df.isnull().sum() #sum of null values

ID        0
Name      0
Age       0
Marks     0
Gender    0
dtype: int64

In [ ]:
df.nunique #unique values

<bound method DataFrame.nunique of        ID          Name  Age  Marks  Gender
0       1     Student_1   24     94    Male
1       2     Student_2   21     81  Female
2       3     Student_3   22     90    Male
3       4     Student_4   24     56  Female
4       5     Student_5   20     44  Female
..    ...           ...  ...    ...     ...
995   996   Student_996   23     82  Female
996   997   Student_997   18     73  Female
997   998   Student_998   24     96  Female
998   999   Student_999   21     65    Male
999  1000  Student_1000   23     80    Male

[1000 rows x 5 columns]>

In [ ]:
df['Marks'].mean() #Mean

np.float64(70.232)

In [ ]:
df['Marks'].min() #Min

np.int64(40)

In [ ]:
df['Marks'].max() #Max

np.int64(100)

In [ ]:
df['Marks'].value_counts #Vlaue Count

<bound method IndexOpsMixin.value_counts of 0      94
1      81
2      90
3      56
4      44
       ..
995    82
996    73
997    96
998    65
999    80
Name: Marks, Length: 1000, dtype: int64>

In [ ]:
df['Marks'].median() #Median

np.float64(70.0)

In [ ]:
df['Marks'].sum() #Sum of values

np.int64(70232)

In [ ]:
df.dtypes #Datatypes

ID         int64
Name      object
Age        int64
Marks      int64
Gender    object
dtype: object

In [22]:
df.tail()

       ID          Name  Age  Marks  Gender
995   996   Student_996   23     82  Female
996   997   Student_997   18     73  Female
997   998   Student_998   24     96  Female
998   999   Student_999   21     65    Male
999  1000  Student_1000   23     80    Male

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      1000 non-null   int64
 1   Name    1000 non-null   object
 2   Age     1000 non-null   int64
 3   Marks   1000 non-null   int64
 4   Gender  1000 non-null   object
dtypes: int64(3), object(2)
memory usage: 39.2+ KB